app/views/teacher/show.html.erb

        <a href="/assignment/<%= assignment.id %>"><div class="red_block" id="block-<%= assignment.id %>">
          <% assignment.students.each do |pair| %>
---
SELECT "students".* FROM "students" INNER JOIN "assignment_students" ON "students"."id" = "assignment_students"."student_id" WHERE "assignment_students"."assignment_id" = $1  [["assignment_id", 1]]