app/controllers/assignment_controller.rb

	def show
		@messages = Message.all
		@assignment = Assignment.find(params[:id])
		@instructions = AssignmentType.find_by(id: @assignment.assignment_type_id)
		@student1 = @assignment.students.first
---
SELECT "messages".* FROM "messages"
SELECT  "assignments".* FROM "assignments"  WHERE "assignments"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "assignment_types".* FROM "assignment_types"  WHERE "assignment_types"."id" = 1 LIMIT 1
SELECT  "students".* FROM "students" INNER JOIN "assignment_students" ON "students"."id" = "assignment_students"."student_id" WHERE "assignment_students"."assignment_id" = $1  ORDER BY "students"."id" DESC LIMIT 1  [["assignment_id", 2]]

	def update
		@assignment = Assignment.find(params[:id])
		@assignment.update(student_submission)
---
SELECT  "assignments".* FROM "assignments"  WHERE "assignments"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "assignments" SET "submission" = $1, "updated_at" = $2 WHERE "assignments"."id" = 2  [["submission", "Hello. This is the assignment page"], ["updated_at", "2014-09-27 22:21:37.692912"]]