app/controllers/message_controller.rb

	def create
		@message = Message.create(message_params)
---
INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "fdsfad"], ["created_at", "2014-09-28 02:10:52.174241"], ["updated_at", "2014-09-28 02:10:52.174241"]]