app/controllers/sessions_controller.rb

SELECT  "teachers".* FROM "teachers"  WHERE "teachers"."email" = 'hornickel@school.edu' LIMIT 1
---
  def create
  	reset_session
  	@teacher = Teacher.find_by_email(teacher_params[:email])