app/controllers/teacher_controller.rb

SELECT "assignments".* FROM "assignments"
SELECT  "assignment_types".* FROM "assignment_types"   ORDER BY "assignment_types"."id" ASC LIMIT 1
---
  def show
    current_teacher
    @assignments = Assignment.all
    @type = AssignmentType.first